trade_exp/src/Documents/АрендаНоменклатурыВозврат/АрендаНоменклатурыВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b577dbdc-2a6b-4b2d-b6cf-0a93b48f1df2">
  <name>АрендаНоменклатурыВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e3901c84-75de-46a1-863d-59aedfc4f14a">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37669b80-5f0d-4859-8cf6-ac1dd38b413d">
    <name>ВернутьКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dcd20e0-3e3e-4b81-98d9-e069a9ecb9a7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="371cc52a-75a3-45eb-8dc0-d92862f3bc67">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70f4af0e-c196-4068-bc6a-3807dbb3f1df">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6b7634b-4465-4ade-ba0f-a4c57d7d6cc5">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="293c0735-2c1e-4d96-9750-c9019ff8fe34">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="058cddf0-872e-43cc-8378-80345c5e7272">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78db0f2d-66e6-4192-abc2-83fc34f2ec80">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d451234-16b9-4e75-8444-3a41ee8d691f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f4a101a1-ccb9-46c9-af17-3fbdc9dd398b">
    <name>ДатаВозвратаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb6b3e32-e5e7-44cf-9907-e01ef8b3225b">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="85fda3ba-c7ae-4f55-a1c7-da66cb7bb5cd">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f79debbe-ceed-4aac-bc88-8cf8df82df76">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b50aa1f2-b6d6-4558-8409-2e20f83b1338">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a2379c0c-4eb1-4eba-a219-f9fc5791c645">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1f071d60-9c4d-4980-8801-caab222b97c9">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75be784e-694a-43ca-adb4-1bbe575e97b8">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="201e8bc2-0588-4a5f-8ec6-f4544ff8bc28">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd4c673-05a1-4f63-ad60-280c2798e5a7">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f60a5e6-bee1-4cc6-b10e-cd5e4e47eaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c25caf32-20e2-40ae-a10e-2a35939bd3a2">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4657879-4faa-4ac3-99a8-43288988dfdb">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d48325f-35a7-4124-920e-97d78344b8fc">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1921686-2250-4b72-8442-dbd4021e6cf3">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2c36ffd4-5c5f-4003-a280-3a0703441e53">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3bf3c2e8-cc67-4c9a-82a1-85a627b70355">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b428f1b-e0af-4cc5-90ce-7d26bc5a7ada">
      <name>ДатаСдачиВАренду</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2e2a3cf6-adec-4c52-a3de-1c02f1ff140a">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/АрендаНоменклатурыВозврат/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановитьВидимостьДоступностьНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
КонецПроцедуры

#КонецОбласти


#Область ПересчетыВидимость
&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
КонецПроцедуры
&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере()
	
КонецПроцедуры
 //10.01.24
&НаСервере
Процедура УстановитьТекущееВремяВозврата()
	  Если Формат(Объект.ДатаВозвратаФакт,"ДФ=""дд/ММ/гггг""") = Формат(Объект.Дата,"ДФ=""дд/ММ/гггг""") Тогда
	      Объект.ДатаВозвратаФакт = Объект.Дата;
	  КонецЕсли;
	  Если Объект.Дата = НачалоДня(Объект.Дата) Тогда
	      Объект.ДатаВозвратаФакт = ТекущаяДатаСеанса();	  
	  КонецЕсли;
	  Если Параметры.Ключ.Пустая() Тогда
	      Объект.ДатаВозвратаФакт = ТекущаяДатаСеанса();	  
	  КонецЕсли;
	  
КонецПроцедуры	


&НаКлиенте
Процедура ДатаВозвратаПриИзменении(Элемент)
	УстановитьТекущееВремяВозврата(); //10.01.24
	ПересчитатьСтрокиНаСервере();
	РасчитатьИтоги();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокиНаСервере()
   Для Каждого стрТовар Из Объект.Товары Цикл
      ПересчитатьСтрокуУслугиНаСервере(стрТовар);
   КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуУслугиНаСервере(ТекущаяСтрока)
   КоличествоУслуги= (Объект.ДатаВозвратаФакт-ТекущаяСтрока.ДатаСдачиВАренду)/(3600*24);
   КоличествоУслуги= ?(КоличествоУслуги<1, 1, КоличествоУслуги);
   КоличествоУслуги= ?(Цел(КоличествоУслуги) < КоличествоУслуги, Цел(КоличествоУслуги)+1, КоличествоУслуги);
   
   ТекущаяСтрока.КоличествоУслуги= КоличествоУслуги; 
   
   ТекущаяСтрока.СуммаСНДСУслуги= ТекущаяСтрока.ЦенаУслуги*ТекущаяСтрока.КоличествоУслуги;
КонецПроцедуры
#КонецОбласти

#Область СобытияШапки
&НаКлиенте
Процедура РасчитатьИтоги()
	Объект.СуммаУслуг= Объект.Товары.Итог("СуммаСНДСУслуги");	
	Объект.СуммаЗалога= Объект.Товары.Итог("СуммаЗалога");
	Объект.ВернутьКлиенту= Объект.СуммаЗалога-Объект.СуммаУслуг;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры

#КонецОбласти
